# Predictive Analysis: ANZ Synthesized 3-month Transactional Dataset

In [249]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

%matplotlib inline

## Background

Source: https://www.theforage.com/modules/ZLJCsrpkHo9pZBJNY/BiJPfqmGY2QwgN6gA

This task is based on a synthesised transaction dataset containing 3 months’ worth of transactions for 100 hypothetical customers. It contains purchases, recurring transactions, and salary transactions. The dataset is designed to simulate realistic transaction behaviours that are observed in ANZ’s real transaction data, so many of the insights gathered from the activities will be genuine.

*NOTE*: Data preprocessing for this dataset was already done in the notebook for Task 1. If reference for data preprocessing is required, please refer to Steps 0 and 1 in the notebook file 'Task 1. Exploratory Data Analysis.ipynb'. The dataset to be loaded here should be the cleaned file named 'DATA/ANZ-synthesized-transactions-cleaned.csv'

## Step 0: Load the dataset and perform EDA

### Overview
The aim of this dataset is to try to understand the features of purchasing behaviour of customers as a predictor metric for modelling expected values for annual pay/ salary

The plan of execution is to configure the best model for predicting customer's annual salary. According to the principle of Occam's Razor, simpler models will be preferred to more complex models, and the generation of models will stop when it can accurately predict new data.

In [250]:
# referencing the cleaned dataset
file = 'DATA/ANZ-synthesized-transactions-cleaned.csv'
# Read file and parse timestamp as the index
df = pd.read_csv(file)

In [251]:
# To display the first 5 rows of the data
df.head()

,timestamp,status,card_present_flag,account,first_name,age,gender,txn_description,balance,amount,...,X,Y,merch_suburb,merch_state,merch_geometry,merch_X,merch_Y,distance,country,card_present_bool
0,2018-08-01 01:01:15+00:00,authorized,1,1598451071,Diana,26,F,POS,35.39,16.25,...,-27.95,153.41,Ashmore,QLD,153.38 -27.99,-27.99,153.38,5.34,Australia,True
1,2018-08-01 01:13:45+00:00,authorized,0,1598451071,Diana,26,F,SALES-POS,21.20,14.19,...,-27.95,153.41,Sydney,NSW,151.21 -33.87,-33.87,151.21,691.63,Australia,False
2,2018-08-01 01:26:15+00:00,authorized,1,1222300524,Michael,38,M,POS,5.71,6.42,...,-33.94,151.23,Sydney,NSW,151.21 -33.87,-33.87,151.21,8.01,Australia,True
3,2018-08-01 01:38:45+00:00,authorized,1,1037050564,Rhonda,40,F,SALES-POS,2117.22,40.90,...,-27.66,153.10,Buderim,QLD,153.05 -26.68,-26.68,153.05,109.20,Australia,True
4,2018-08-01 01:51:15+00:00,authorized,1,1598451071,Diana,26,F,SALES-POS,17.95,3.25,...,-27.95,153.41,Mermaid Beach,QLD,153.44 -28.06,-28.06,153.44,12.60,Australia,True

In [252]:
# check the shape of the DataFrame
df.shape

(12043, 21)

* Rows in dataset: 12043
* Columns in dataset: 21

In [253]:
# display all missing values
df.isna().sum()

timestamp            0
status               0
card_present_flag    0
account              0
first_name           0
age                  0
gender               0
txn_description      0
balance              0
amount               0
geometry             0
X                    0
Y                    0
merch_suburb         0
merch_state          0
merch_geometry       0
merch_X              0
merch_Y              0
distance             0
country              0
card_present_bool    0
dtype: int64

## Step 1: Identify annual salary of each customer

### a) Drop irrelevant features and create dummies

In [254]:
# confirmation of data types prior to conversion
df.dtypes

timestamp             object
status                object
card_present_flag      int64
account                int64
first_name            object
age                    int64
gender                object
txn_description       object
balance              float64
amount               float64
geometry              object
X                    float64
Y                    float64
merch_suburb          object
merch_state           object
merch_geometry        object
merch_X              float64
merch_Y              float64
distance             float64
country               object
card_present_bool       bool
dtype: object

* drop all features that are unrelated to purchasing behaviour, as well as any feature that cannot be converted into a helpful categorical/ numerical dummy vairable:
    - timestamp
    - country
    - card_present_bool
    - merch_suburb (use coords)
    - merch_state (use coords)
    - geometry (use X, Y)
    - merch_geometry
    - merch_X
    - merch_Y
    - distance
* Since we want to group data into an annual salary aggregate table of customer indexes, these dummy variables will need to be merged later on as predictors

In [255]:
df = df.drop(columns=['country', 'timestamp', 'geometry', 'merch_suburb', 'merch_state', 
                       'merch_geometry', 'merch_X', 'merch_Y', 'distance', 'card_present_bool'])

In [256]:
# get dummy variables
df = pd.get_dummies(data=df, columns=['status', 'gender'], prefix=['status', 'gender'], drop_first=True)

In [257]:
df.head()

,card_present_flag,account,first_name,age,txn_description,balance,amount,X,Y,status_posted,gender_M
0,1,1598451071,Diana,26,POS,35.39,16.25,-27.95,153.41,0,0
1,0,1598451071,Diana,26,SALES-POS,21.20,14.19,-27.95,153.41,0,0
2,1,1222300524,Michael,38,POS,5.71,6.42,-33.94,151.23,0,1
3,1,1037050564,Rhonda,40,SALES-POS,2117.22,40.90,-27.66,153.10,0,0
4,1,1598451071,Diana,26,SALES-POS,17.95,3.25,-27.95,153.41,0,0

### b) Subset Pay/Salary transactions and group by account

In [258]:
# display counts of payment types
df.txn_description.value_counts()

SALES-POS     3934
POS           3783
PAYMENT       2600
PAY/SALARY     883
INTER BANK     742
PHONE BANK     101
Name: txn_description, dtype: int64

In [259]:
# Check the distinct values for each column
df.nunique()

card_present_flag        2
account                100
first_name              80
age                     33
txn_description          6
balance              12006
amount                4457
X                       85
Y                       87
status_posted            2
gender_M                 2
dtype: int64

- *NOTE*: First name and account column number of unique values do not match up:
     - First name has 80 unique values
     - Account has 100 unique values
- It would be helpful for us to index these by account as it has better unique identification of customers.
- In order to get a good target feature for annual salary, the index should be a sum of all the pay/ salary type descriptions grouped by each account.

In [260]:
df_annual_pay = df[df.txn_description == 'PAY/SALARY']

In [261]:
df_annual_pay = df_annual_pay.groupby('account').sum()

In [263]:
df_annual_pay.head()

,card_present_flag,age,balance,amount,X,Y,status_posted,gender_M
account,,,,,,,,
37709441,0,126,98107.03,28925.61,-196.07,1073.87,7,7
38923874,0,494,506145.72,24452.35,-440.70,1966.51,13,13
53508546,0,420,54704.11,8703.84,-405.12,1807.44,12,0
80388494,0,168,35050.32,11499.06,-224.52,869.82,6,6
90814749,0,210,65301.33,13852.02,-197.88,910.08,6,6

In [264]:
# sum of distance shows that the subset of pay/salary has no distance metric
df_annual_pay.sum()

card_present_flag           0.00
age                     28814.00
balance              14342444.54
amount                1676576.85
X                      -33333.37
Y                      126692.77
status_posted             883.00
gender_M                  464.00
dtype: float64

* As evident above, card_present_flag is useless for our prediction model
* Age, balance, X and Y are good as cumulative measures even though their range should be scaled/ normalized by a scaler, mean or std dev
* However, since we are able to use a unique age, X and Y for each customer key in the table we dont have to keep this measures in our annual salary DataFrame.
* status_posted is not useful in this case because all Pay/ Salary transaction types are functionally dependent on the status of posted. Hence, this column can be dropped
* gender_M is relevant but should be dropped in this aggregation as its better to be merged with the original dataset on the index key

In [265]:
df_annual_pay = df_annual_pay.drop(columns=['card_present_flag', 'age', 'X', 'Y', 'status_posted', 'gender_M'])

* Basically, all customer unique fields (fully dependent features) have been dropped.
* Only balance is a valid cumulative measure because it is not uniquely identified by the key.

In [266]:
# this confirms we have all 100 accounts in new dataset group
df_annual_pay.shape

(100, 2)

In [267]:
df_annual_pay.amount.describe()

count      100.000000
mean     16765.768500
std       6741.543716
min       7155.960000
25%      11591.332500
50%      14813.485000
75%      21332.515000
max      35343.920000
Name: amount, dtype: float64

* The max salary is **\$35343.92** and the min salary is **\$7155.96**
* This range of salary amounts is not an accurate measure of the entire year
* Imputing values for an entire year is unrealistic. Perhaps the annual salary can be inferred from a model

### c) Merge a customer table with pay/salary table

* Here, a customer table is extracted from the original data, dropping everything that is not fully dependent on the primary key, satisfying 3NF.
* The reason why the cleaning is done for 3NF here is because most of the cleaning has already met 1NF and 2NF rules, even though we are not making relational tables.

In [268]:
df.head()

,card_present_flag,account,first_name,age,txn_description,balance,amount,X,Y,status_posted,gender_M
0,1,1598451071,Diana,26,POS,35.39,16.25,-27.95,153.41,0,0
1,0,1598451071,Diana,26,SALES-POS,21.20,14.19,-27.95,153.41,0,0
2,1,1222300524,Michael,38,POS,5.71,6.42,-33.94,151.23,0,1
3,1,1037050564,Rhonda,40,SALES-POS,2117.22,40.90,-27.66,153.10,0,0
4,1,1598451071,Diana,26,SALES-POS,17.95,3.25,-27.95,153.41,0,0

* To avoid the inclusion of duplicate values, customer table should be in 3NF

In [269]:
df_cust = df[['account', 'first_name', 'age', 'X', 'Y', 'gender_M']]

*NOTE*: The reason why X and Y is considered to be fully dependent on the customer account number is because they represent the location of the customer

In [270]:
df_cust = df_cust.drop_duplicates()

In [271]:
df_cust.set_index('account', inplace=True)

In [276]:
df_cust.sort_index().head()

           first_name  age      X       Y  gender_M
account
37709441      Charles   18 -28.01  153.41         1
38923874         Ryan   38 -33.90  151.27         1
53508546     Kimberly   35 -33.76  150.62         0
80388494       Dustin   28 -37.42  144.97         1
90814749  Christopher   35 -32.98  151.68         1

In [277]:
df_annual_pay.sort_index().head()

            balance    amount
account
37709441   98107.03  28925.61
38923874  506145.72  24452.35
53508546   54704.11   8703.84
80388494   35050.32  11499.06
90814749   65301.33  13852.02

In [281]:
df_merged = df_cust.merge(df_annual_pay, how='inner', on='account').sort_index()

In [282]:
df_merged.shape

(100, 7)

In [283]:
df_merged.head()

           first_name  age      X       Y  gender_M    balance    amount
account
37709441      Charles   18 -28.01  153.41         1   98107.03  28925.61
38923874         Ryan   38 -33.90  151.27         1  506145.72  24452.35
53508546     Kimberly   35 -33.76  150.62         0   54704.11   8703.84
80388494       Dustin   28 -37.42  144.97         1   35050.32  11499.06
90814749  Christopher   35 -32.98  151.68         1   65301.33  13852.02

In [284]:
features = list(set(df_merged.columns) - set(df_merged[['first_name', 'amount']]))

## Step 2: Explore correlations between annual salary and various customer attributes

In [285]:
X = df_merged[features]

In [287]:
X.

          gender_M       age         X   balance         Y
gender_M  1.000000  0.012067 -0.087341  0.120298  0.096176
age       0.012067  1.000000  0.070489  0.289224  0.008673
X        -0.087341  0.070489  1.000000  0.027556 -0.702603
balance   0.120298  0.289224  0.027556  1.000000 -0.015205
Y         0.096176  0.008673 -0.702603 -0.015205  1.000000